In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

<br>

## Object Creation
---

See the [Data Structure Intro section](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dsintro).

### Create a Series

Create a **Series** by passing a list of values, letting pandas create a default integer index:

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### Create a DataFrame

+ From a **numpy array**, with a datetime **index** and labeled **columns**:

In [4]:
dates = pd.date_range('20130101', periods = 6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01 -1.151245  2.135387  0.315433  1.244296
2013-01-02  0.920980 -0.007921 -0.678359 -0.060078
2013-01-03 -1.713681 -0.592537  0.594618  1.042195
2013-01-04  0.291161 -1.011137 -0.736493  1.058137
2013-01-05 -1.499296  0.502565 -1.101389 -0.382417
2013-01-06  1.737790 -0.106322 -0.726821  1.511071

* From a **dict** of objects that can be converted to series-like.

In [8]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Having specific dtypes

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

`df2.<TAB>` helps look up the list of all available functions.

<br><br>

## Viewing Data
---
See the [Basics section](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics "Essential Basic Functionality")

See the top & bottom rows of the frame.

In [11]:
df.head()

                   A         B         C         D
2013-01-01 -1.151245  2.135387  0.315433  1.244296
2013-01-02  0.920980 -0.007921 -0.678359 -0.060078
2013-01-03 -1.713681 -0.592537  0.594618  1.042195
2013-01-04  0.291161 -1.011137 -0.736493  1.058137
2013-01-05 -1.499296  0.502565 -1.101389 -0.382417

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.291161 -1.011137 -0.736493  1.058137
2013-01-05 -1.499296  0.502565 -1.101389 -0.382417
2013-01-06  1.737790 -0.106322 -0.726821  1.511071

Display the index, colums, and the underlying numpy data.

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [15]:
df.values

array([[-1.15124488,  2.1353869 ,  0.3154332 ,  1.24429637],
       [ 0.92097955, -0.00792084, -0.67835908, -0.06007828],
       [-1.71368096, -0.59253737,  0.59461783,  1.04219508],
       [ 0.29116065, -1.01113718, -0.7364927 ,  1.05813683],
       [-1.49929636,  0.50256457, -1.10138889, -0.38241723],
       [ 1.7377902 , -0.10632165, -0.72682066,  1.51107124]])

Describe shows a quick statistic summary of your data.

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.235715  0.153339 -0.388835  0.735534
std    1.423340  1.100567  0.676732  0.766971
min   -1.713681 -1.011137 -1.101389 -0.382417
25%   -1.412283 -0.470983 -0.734075  0.215490
50%   -0.430042 -0.057121 -0.702590  1.050166
75%    0.763525  0.374943  0.066985  1.197756
max    1.737790  2.135387  0.594618  1.511071

Transposing your data.

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.151245    0.920980   -1.713681    0.291161   -1.499296    1.737790
B    2.135387   -0.007921   -0.592537   -1.011137    0.502565   -0.106322
C    0.315433   -0.678359    0.594618   -0.736493   -1.101389   -0.726821
D    1.244296   -0.060078    1.042195    1.058137   -0.382417    1.511071

Sorting by an axis.

In [18]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01  1.244296  0.315433  2.135387 -1.151245
2013-01-02 -0.060078 -0.678359 -0.007921  0.920980
2013-01-03  1.042195  0.594618 -0.592537 -1.713681
2013-01-04  1.058137 -0.736493 -1.011137  0.291161
2013-01-05 -0.382417 -1.101389  0.502565 -1.499296
2013-01-06  1.511071 -0.726821 -0.106322  1.737790

In [19]:
df.sort_values(by = 'B', ascending = False)

                   A         B         C         D
2013-01-01 -1.151245  2.135387  0.315433  1.244296
2013-01-05 -1.499296  0.502565 -1.101389 -0.382417
2013-01-02  0.920980 -0.007921 -0.678359 -0.060078
2013-01-06  1.737790 -0.106322 -0.726821  1.511071
2013-01-03 -1.713681 -0.592537  0.594618  1.042195
2013-01-04  0.291161 -1.011137 -0.736493  1.058137

<br><br>

## Selection
---

**Note:** While standard Python/Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at; .iat, .loc, .iloc and .ix.

See the indexing documentation [Indexing and Selecting Data](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing "Indexing and Selecting Data") and [MultiIndex / Advanced Indexing](https://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced "MultiIndex / Advanced Indexing").

### Getting

Selecting a single column, which yields a *Series*.

In [20]:
df['A']

2013-01-01   -1.151245
2013-01-02    0.920980
2013-01-03   -1.713681
2013-01-04    0.291161
2013-01-05   -1.499296
2013-01-06    1.737790
Freq: D, Name: A, dtype: float64

In [21]:
df.A

2013-01-01   -1.151245
2013-01-02    0.920980
2013-01-03   -1.713681
2013-01-04    0.291161
2013-01-05   -1.499296
2013-01-06    1.737790
Freq: D, Name: A, dtype: float64

Selecting via `[]`, which slices the rows.

In [22]:
df[0 : 3]

                   A         B         C         D
2013-01-01 -1.151245  2.135387  0.315433  1.244296
2013-01-02  0.920980 -0.007921 -0.678359 -0.060078
2013-01-03 -1.713681 -0.592537  0.594618  1.042195

In [23]:
df['20130102' : '20130104']

                   A         B         C         D
2013-01-02  0.920980 -0.007921 -0.678359 -0.060078
2013-01-03 -1.713681 -0.592537  0.594618  1.042195
2013-01-04  0.291161 -1.011137 -0.736493  1.058137

### Selection by Label

See more in [Selection by Label](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-label "Selection By Label").

For getting a cross section using a Label.

In [24]:
df.loc[dates[0]]

A   -1.151245
B    2.135387
C    0.315433
D    1.244296
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label.

In [25]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -1.151245  2.135387
2013-01-02  0.920980 -0.007921
2013-01-03 -1.713681 -0.592537
2013-01-04  0.291161 -1.011137
2013-01-05 -1.499296  0.502565
2013-01-06  1.737790 -0.106322

Showing label slicing, both endpoints are _included_.

In [26]:
df.loc['20130102' : '20130104', ['A', 'B']]

                   A         B
2013-01-02  0.920980 -0.007921
2013-01-03 -1.713681 -0.592537
2013-01-04  0.291161 -1.011137

Reduction in the dimensions of the returned object.

In [27]:
df.loc['20130102', ['A', 'B']]

A    0.920980
B   -0.007921
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value

In [28]:
df.loc[dates[0], 'A']

-1.1512448829323327

For getting fast access to a scalar (equiv to the prior method)

In [29]:
df.at[dates[0], 'A']

-1.1512448829323327

### Selection by Position
See more in [Selection by Position](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer "Selection by Position")

Select via the position of the passed integers

In [30]:
df.iloc[3]

A    0.291161
B   -1.011137
C   -0.736493
D    1.058137
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to nump/python

In [31]:
df.iloc[3 : 5, 0 : 2]

                   A         B
2013-01-04  0.291161 -1.011137
2013-01-05 -1.499296  0.502565

By lists of integer position locations, similar to the numpy/python style.

In [32]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.920980 -0.678359
2013-01-03 -1.713681  0.594618
2013-01-05 -1.499296 -1.101389

For slicing rows explicitly

In [33]:
df.iloc[1 : 3, :]

                   A         B         C         D
2013-01-02  0.920980 -0.007921 -0.678359 -0.060078
2013-01-03 -1.713681 -0.592537  0.594618  1.042195

For slicing columns explicitly

In [34]:
df.iloc[:, 1 : 3]

                   B         C
2013-01-01  2.135387  0.315433
2013-01-02 -0.007921 -0.678359
2013-01-03 -0.592537  0.594618
2013-01-04 -1.011137 -0.736493
2013-01-05  0.502565 -1.101389
2013-01-06 -0.106322 -0.726821

For getting a value explicitly

In [35]:
df.iloc[1, 1]

-0.0079208356499683181

For getting fast access to a scalar (equiv to the prior method)

In [36]:
df.iat[1, 1]

-0.0079208356499683181

### Boolean Indexing

Using a single column's values to select data.

In [37]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.920980 -0.007921 -0.678359 -0.060078
2013-01-04  0.291161 -1.011137 -0.736493  1.058137
2013-01-06  1.737790 -0.106322 -0.726821  1.511071

Selecting values from a DataFrame where a boolean condition is met.

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  2.135387  0.315433  1.244296
2013-01-02  0.920980       NaN       NaN       NaN
2013-01-03       NaN       NaN  0.594618  1.042195
2013-01-04  0.291161       NaN       NaN  1.058137
2013-01-05       NaN  0.502565       NaN       NaN
2013-01-06  1.737790       NaN       NaN  1.511071

Using the `isin()` method for filtering:

In [39]:
df2 = df.copy()

In [40]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [41]:
df2

                   A         B         C         D      E
2013-01-01 -1.151245  2.135387  0.315433  1.244296    one
2013-01-02  0.920980 -0.007921 -0.678359 -0.060078    one
2013-01-03 -1.713681 -0.592537  0.594618  1.042195    two
2013-01-04  0.291161 -1.011137 -0.736493  1.058137  three
2013-01-05 -1.499296  0.502565 -1.101389 -0.382417   four
2013-01-06  1.737790 -0.106322 -0.726821  1.511071  three

### Setting

Setting a new column automatically aligns the data by the indexes.

In [42]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range('20130102', periods = 6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

Setting values by label

In [43]:
df.at[dates[0], 'A'] = 0

Setting values by position

In [44]:
df.iat[0, 1] = 0

Setting by assigning with a numpy array

In [45]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [46]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.315433  5
2013-01-02  0.920980 -0.007921 -0.678359  5
2013-01-03 -1.713681 -0.592537  0.594618  5
2013-01-04  0.291161 -1.011137 -0.736493  5
2013-01-05 -1.499296  0.502565 -1.101389  5
2013-01-06  1.737790 -0.106322 -0.726821  5

A **`where`** operation with setting.

In [47]:
df2 = df.copy()

In [48]:
df2[df2 > 0] = - df2

In [49]:
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.315433 -5
2013-01-02 -0.920980 -0.007921 -0.678359 -5
2013-01-03 -1.713681 -0.592537 -0.594618 -5
2013-01-04 -0.291161 -1.011137 -0.736493 -5
2013-01-05 -1.499296 -0.502565 -1.101389 -5
2013-01-06 -1.737790 -0.106322 -0.726821 -5

<br><br>

## Missing Data
---

pandas primarily uses the value `np.nan` to represent missing data. It is by default not included in computations. See the [Missing Data Section](https://pandas.pydata.org/pandas-docs/stable/missing_data.html#missing-data "Working with missing data")

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [50]:
df1 = df.reindex(index = dates[0 : 4], columns = list(df.columns) + ['E'])

In [51]:
df1

                   A         B         C  D   E
2013-01-01  0.000000  0.000000  0.315433  5 NaN
2013-01-02  0.920980 -0.007921 -0.678359  5 NaN
2013-01-03 -1.713681 -0.592537  0.594618  5 NaN
2013-01-04  0.291161 -1.011137 -0.736493  5 NaN

In [52]:
df1.loc[dates[0]: dates[1], 'E'] = 1

In [53]:
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.315433  5  1.0
2013-01-02  0.920980 -0.007921 -0.678359  5  1.0
2013-01-03 -1.713681 -0.592537  0.594618  5  NaN
2013-01-04  0.291161 -1.011137 -0.736493  5  NaN

To drop any rows that have missing data.

In [54]:
df1.dropna(how = 'any')

                  A         B         C  D    E
2013-01-01  0.00000  0.000000  0.315433  5  1.0
2013-01-02  0.92098 -0.007921 -0.678359  5  1.0

Filling missing data

In [55]:
df1.fillna(value = 5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.315433  5  1.0
2013-01-02  0.920980 -0.007921 -0.678359  5  1.0
2013-01-03 -1.713681 -0.592537  0.594618  5  5.0
2013-01-04  0.291161 -1.011137 -0.736493  5  5.0

To get the boolean mask where values are `nan`

In [56]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

<br><br>

## Operations
---
See the [Basic section on Binary Ops](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop "Flexible binary operations")

### Stats

Operations in general _exclude_ missing data.

Performing a descriptive statistic.

In [57]:
df.mean()

A   -0.043841
B   -0.202559
C   -0.388835
D    5.000000
dtype: float64

In [58]:
df.mean(0)    # same as above

A   -0.043841
B   -0.202559
C   -0.388835
D    5.000000
dtype: float64

Same operation on the other axis.

In [59]:
df.mean(1)

2013-01-01    1.328858
2013-01-02    1.308675
2013-01-03    0.822100
2013-01-04    0.885883
2013-01-05    0.725470
2013-01-06    1.476162
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [60]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(2)

In [61]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [62]:
df.sub(s, axis = 'index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -2.713681 -1.592537 -0.405382  4.0
2013-01-04 -2.708839 -4.011137 -3.736493  2.0
2013-01-05 -6.499296 -4.497435 -6.101389  0.0
2013-01-06       NaN       NaN       NaN  NaN

### Apply

Applying functions to the data.

In [63]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  0.315433   5
2013-01-02  0.920980 -0.007921 -0.362926  10
2013-01-03 -0.792701 -0.600458  0.231692  15
2013-01-04 -0.501541 -1.611595 -0.504801  20
2013-01-05 -2.000837 -1.109031 -1.606190  25
2013-01-06 -0.263047 -1.215352 -2.333010  30

In [64]:
df.apply(lambda x: x.max() - x.min())

A    3.451471
B    1.513702
C    1.696007
D    0.000000
dtype: float64

### Histogramming

See more at [Histogramming and Discretization](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization "Histogramming and Discretization").

In [65]:
s = pd.Series(np.random.randint(0, 7, size = 10))

In [66]:
s

0    5
1    2
2    3
3    2
4    4
5    3
6    5
7    5
8    6
9    6
dtype: int64

### String Methods

Series is equipped with a set of string processing methods in the _str_ attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in _str_ generally uses [regular expressions](https://docs.python.org/2/library/re.html "Regular expression operations") by default (and in some cases always uses them). See more at [Vectorizing String Methods](https://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods "Working with Text Data").

In [67]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [68]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

<br><br>

## Merge
---
### Concat

**`pd.concat()`** combines dataframes **vertically**.
See the [Merging section](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging "Merge, join, and concatenate").

Concatenating pandas objects together with **`concat()`**:

In [69]:
df = pd.DataFrame(np.random.randn(10, 4))

In [70]:
df

          0         1         2         3
0  0.207081  0.471334 -0.838968  1.504522
1  0.859450 -0.379802 -0.640044 -2.220086
2 -0.215174  0.218817 -0.050697  1.061165
3  0.201498  0.387249 -1.418478  0.515991
4 -0.529626 -1.701973 -0.919016 -0.089885
5 -0.184360  1.762073  1.638023  1.908229
6  1.053077  0.284344  0.794606 -0.651995
7  0.935268  1.092794 -0.353333  0.077360
8  0.753558 -1.601098  0.647484 -0.491383
9  1.394530 -0.355425  0.482833  0.882305

Break it into pieces.

In [71]:
pieces = [df[: 3], df[3 : 7], df[7 : ]]

In [72]:
pieces

[          0         1         2         3
 0  0.207081  0.471334 -0.838968  1.504522
 1  0.859450 -0.379802 -0.640044 -2.220086
 2 -0.215174  0.218817 -0.050697  1.061165,
           0         1         2         3
 3  0.201498  0.387249 -1.418478  0.515991
 4 -0.529626 -1.701973 -0.919016 -0.089885
 5 -0.184360  1.762073  1.638023  1.908229
 6  1.053077  0.284344  0.794606 -0.651995,
           0         1         2         3
 7  0.935268  1.092794 -0.353333  0.077360
 8  0.753558 -1.601098  0.647484 -0.491383
 9  1.394530 -0.355425  0.482833  0.882305]

In [73]:
pd.concat(pieces)

          0         1         2         3
0  0.207081  0.471334 -0.838968  1.504522
1  0.859450 -0.379802 -0.640044 -2.220086
2 -0.215174  0.218817 -0.050697  1.061165
3  0.201498  0.387249 -1.418478  0.515991
4 -0.529626 -1.701973 -0.919016 -0.089885
5 -0.184360  1.762073  1.638023  1.908229
6  1.053077  0.284344  0.794606 -0.651995
7  0.935268  1.092794 -0.353333  0.077360
8  0.753558 -1.601098  0.647484 -0.491383
9  1.394530 -0.355425  0.482833  0.882305

### Join

**`pd.merge()`** merges dataframes **horizontally**. Just like SQL style merges. See the [Database style joining](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join "Database-style DataFrame joining/merging").

Example 1:

In [74]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [75]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [76]:
left

   key  lval
0  foo     1
1  foo     2

In [77]:
right

   key  rval
0  foo     4
1  foo     5

In [78]:
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Example 2:

In [79]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [80]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [81]:
left

   key  lval
0  foo     1
1  bar     2

In [82]:
right

   key  rval
0  foo     4
1  bar     5

In [83]:
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append

Append rows to a dataframe. See the [Appending](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation "Concatenating using append").

In [84]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

In [85]:
df

          A         B         C         D
0 -0.303744 -1.627896  0.272797 -0.007977
1  2.012547  0.893648 -1.324008  0.982538
2  1.112323 -0.598043  0.428953  0.755541
3  1.837114 -1.330702 -1.678282 -0.472006
4 -0.250183  0.039900 -0.390019  1.679978
5 -0.273232  0.769950  0.468201 -0.619422
6 -0.601851 -0.637132  0.201432 -0.710817
7 -1.140444  0.403012  0.576544 -0.385594

In [86]:
s = df.iloc[3]

In [87]:
s

A    1.837114
B   -1.330702
C   -1.678282
D   -0.472006
Name: 3, dtype: float64

In [88]:
df.append(s, ignore_index = True)

          A         B         C         D
0 -0.303744 -1.627896  0.272797 -0.007977
1  2.012547  0.893648 -1.324008  0.982538
2  1.112323 -0.598043  0.428953  0.755541
3  1.837114 -1.330702 -1.678282 -0.472006
4 -0.250183  0.039900 -0.390019  1.679978
5 -0.273232  0.769950  0.468201 -0.619422
6 -0.601851 -0.637132  0.201432 -0.710817
7 -1.140444  0.403012  0.576544 -0.385594
8  1.837114 -1.330702 -1.678282 -0.472006

<br><br>

## Grouping
---
By "group by" we are referring to a process involving one or more of the following steps
- **Splitting** the data into groups based on some criteria
- **Applying** a function to each group independently
- **Combining** the results into a data structure

See the [Grouping Section](https://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby "Group By: split-apply-combine")

In [89]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [90]:
df

     A      B         C         D
0  foo    one -0.246428  0.641967
1  bar    one -1.281053  0.842393
2  foo    two  1.025707  1.471538
3  bar  three -2.276049  0.271163
4  foo    two -0.324559 -0.548972
5  bar    two  0.504407  0.236265
6  foo    one  1.075662  0.407394
7  foo  three -0.369910 -0.270197

Grouping and then applying a function **`sum`** to the resulting groups.

In [91]:
df.groupby('A').sum()

            C         D
A
bar -3.052695  1.349822
foo  1.160472  1.701730

Grouping by multiple columns forms a hierarchical index, which we then apply the function.

In [92]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -1.281053  0.842393
    three -2.276049  0.271163
    two    0.504407  0.236265
foo one    0.829234  1.049362
    three -0.369910 -0.270197
    two    0.701148  0.922566

<br><br>

## Reshaping
---
See the sections on [Hierarchical Indexing](https://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical "Hierarchical indexing (MultiIndex)") and [Reshaping](https://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking "Reshaping by stacking and unstacking").

### Stack

In [93]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [94]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [95]:
index = pd.MultiIndex.from_tuples(tuples, names = ['first', 'second'])

In [96]:
index

MultiIndex(levels=[[u'bar', u'baz', u'foo', u'qux'], [u'one', u'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=[u'first', u'second'])

In [97]:
df = pd.DataFrame(np.random.randn(8, 2), index = index, columns = ['A', 'B'])

In [98]:
df

                     A         B
first second
bar   one     1.179286 -0.524009
      two     0.365006  1.421423
baz   one    -1.435253 -1.157835
      two     0.387341 -1.714900
foo   one    -0.049550  1.018840
      two    -0.433423  0.896300
qux   one    -0.653060  1.509228
      two    -1.720006  1.315937

In [99]:
df2 = df[: 4]

In [100]:
df2

                     A         B
first second
bar   one     1.179286 -0.524009
      two     0.365006  1.421423
baz   one    -1.435253 -1.157835
      two     0.387341 -1.714900

The **`stack`** method "compresses" a level in the the DataFrame's columns.

In [101]:
stacked = df2.stack()

In [102]:
stacked

first  second
bar    one     A    1.179286
               B   -0.524009
       two     A    0.365006
               B    1.421423
baz    one     A   -1.435253
               B   -1.157835
       two     A    0.387341
               B   -1.714900
dtype: float64

With a "stacked" DataFrame or Series (having a `MultiIndex` as the `index`), the inverse operation of **`stack()`** is **`unstack()`**, which by default unstacks the **last level**:

In [103]:
stacked.unstack()

                     A         B
first second
bar   one     1.179286 -0.524009
      two     0.365006  1.421423
baz   one    -1.435253 -1.157835
      two     0.387341 -1.714900

In [104]:
stacked.unstack(2)

                     A         B
first second
bar   one     1.179286 -0.524009
      two     0.365006  1.421423
baz   one    -1.435253 -1.157835
      two     0.387341 -1.714900

In [105]:
stacked.unstack(1)

second        one       two
first
bar   A  1.179286  0.365006
      B -0.524009  1.421423
baz   A -1.435253  0.387341
      B -1.157835 -1.714900

In [106]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.179286 -1.435253
       B -0.524009 -1.157835
two    A  0.365006  0.387341
       B  1.421423 -1.714900

### Pivot Tables

See the section on [Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-pivot "Pivot tables").

In [107]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})

In [108]:
df

        A  B    C         D         E
0     one  A  foo  0.420749  0.268579
1     one  B  foo -0.357331 -1.005766
2     two  C  foo  1.465894 -0.106632
3   three  A  bar -0.252910 -0.985129
4     one  B  bar  1.505958  0.927334
5     one  C  bar  0.326996  0.759087
6     two  A  foo -0.929285 -0.123798
7   three  B  foo -0.139210 -0.097484
8     one  C  foo -0.414775  0.324731
9     one  A  bar -0.326252 -1.870384
10    two  B  bar  1.517495 -0.134392
11  three  C  bar -2.068089 -0.505142

We can produce pivot tables from this data very easily:

In [109]:
pd.pivot_table(df, values = 'D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A -0.326252  0.420749
      B  1.505958 -0.357331
      C  0.326996 -0.414775
three A -0.252910       NaN
      B       NaN -0.139210
      C -2.068089       NaN
two   A       NaN -0.929285
      B  1.517495       NaN
      C       NaN  1.465894

<br><br>

## Time Series
---

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the [Time Series section](https://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries "Time Series / Date functionality").

In [110]:
rng = pd.date_range('1/1/2012', periods = 100, freq = 'S')

In [111]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index = rng)

In [112]:
ts.resample('5Min').sum()

2012-01-01    28003
Freq: 5T, dtype: int64

Time zone representation

In [113]:
rng = pd.date_range('3/6/2012 00:00', periods = 5, freq = 'D')

In [114]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [115]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [116]:
ts

2012-03-06    0.196634
2012-03-07   -0.170732
2012-03-08   -0.914972
2012-03-09   -0.652561
2012-03-10   -0.713764
Freq: D, dtype: float64

In [117]:
ts_utc = ts.tz_localize('UTC')

In [118]:
ts_utc

2012-03-06 00:00:00+00:00    0.196634
2012-03-07 00:00:00+00:00   -0.170732
2012-03-08 00:00:00+00:00   -0.914972
2012-03-09 00:00:00+00:00   -0.652561
2012-03-10 00:00:00+00:00   -0.713764
Freq: D, dtype: float64

Convert to another time zone.

In [119]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.196634
2012-03-06 19:00:00-05:00   -0.170732
2012-03-07 19:00:00-05:00   -0.914972
2012-03-08 19:00:00-05:00   -0.652561
2012-03-09 19:00:00-05:00   -0.713764
Freq: D, dtype: float64

Converting between time span representations.

In [120]:
rng = pd.date_range('1/1/2012', periods = 5, freq = 'M')

In [121]:
rng

DatetimeIndex(['2012-01-31', '2012-02-29', '2012-03-31', '2012-04-30',
               '2012-05-31'],
              dtype='datetime64[ns]', freq='M')

In [122]:
ts = pd.Series(np.random.randn(len(rng)), index = rng)

In [123]:
ts

2012-01-31   -0.480761
2012-02-29   -0.423017
2012-03-31   -1.993730
2012-04-30    0.142594
2012-05-31    1.304180
Freq: M, dtype: float64

In [124]:
ps = ts.to_period()

In [125]:
ps

2012-01   -0.480761
2012-02   -0.423017
2012-03   -1.993730
2012-04    0.142594
2012-05    1.304180
Freq: M, dtype: float64

In [126]:
ps.to_timestamp()

2012-01-01   -0.480761
2012-02-01   -0.423017
2012-03-01   -1.993730
2012-04-01    0.142594
2012-05-01    1.304180
Freq: MS, dtype: float64

Converting between period and timestamp enables some convenient arithmetic functions to be used.<br>
In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [127]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [128]:
prng

PeriodIndex(['1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
             '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
             '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
             '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
             '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
             '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
             '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
             '2000Q3', '2000Q4'],
            dtype='period[Q-NOV]', freq='Q-NOV')

In [129]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [130]:
ts.head(3)

1990Q1   -1.145494
1990Q2   -0.776468
1990Q3   -0.598847
Freq: Q-NOV, dtype: float64

In [131]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [132]:
ts.head()

1990-03-01 09:00   -1.145494
1990-06-01 09:00   -0.776468
1990-09-01 09:00   -0.598847
1990-12-01 09:00    0.005923
1991-03-01 09:00   -1.044754
Freq: H, dtype: float64

<br><br>

## Categoricals

Since version 0.15, pandas can include categorical data in a `DataFrame`. For full docs, see the [categorical introduction](https://pandas.pydata.org/pandas-docs/stable/categorical.html#categorical "Categorical Data") and the [API documentation](https://pandas.pydata.org/pandas-docs/stable/api.html#api-categorical "Categorical API").

In [133]:
df = pd.DataFrame({"id":[1, 2, 3, 4, 5, 6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

Convert the raw grades to a categorical data type using **`.astype()`**.

In [134]:
df["grade"] = df["raw_grade"].astype("category")

In [135]:
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [136]:
df["raw_grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: raw_grade, dtype: object

In [137]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

Rename the categories to more meaningful names (assigning to **`Series.cat.categories`** is **inplace**!)

In [138]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [139]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

Reorder the categories and simultaneously add the missing categories (methods under **`Series .cat`** return a new `Series` per default).

In [140]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [141]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

**Sorting is per order in the categories, not lexical order.**

In [142]:
df.sort_values(by = "grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

Grouping by a categorical column shows also empty categories.

In [143]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

<br><br>

## Plotting
---
See the [Plotting docs](https://pandas.pydata.org/pandas-docs/stable/visualization.html#visualization "Visualization").

In [144]:
ts = pd.Series(np.random.randn(1000), index = pd.date_range('1/1/2000', periods = 1000))

In [145]:
ts = ts.cumsum()

In [146]:
ts.plot()

![image](https://pandas.pydata.org/pandas-docs/stable/_images/series_plot_basic.png)

On DataFrame, **`plot()`** is a convenience to plot all of the columns with labels:

In [147]:
df = pd.DataFrame(np.random.randn(1000, 4), index = ts.index, columns = ['A', 'B', 'C', 'D'])

In [148]:
df = df.cumsum()

In [149]:
plt.figure();
df.plot();
plt.legend(loc = 'best')

![image](https://pandas.pydata.org/pandas-docs/stable/_images/frame_plot_basic.png)

<br><br>

## Getting Data In/Out
---
### CSV
[Writing to a csv file](https://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv "Writing to CSV format")

In [150]:
df.to_csv('foo.csv')

[Reading from a csv file](https://pandas.pydata.org/pandas-docs/stable/io.html#io-read-csv-table "Reading from a csv file")

In [151]:
pd.read_csv('foo.csv').head()

   Unnamed: 0         A         B         C         D
0  2000-01-01 -0.128407  1.053644  0.762004 -0.838496
1  2000-01-02 -0.694843 -1.405031  2.776359  0.947008
2  2000-01-03  1.864596 -0.520070  3.235581  1.903378
3  2000-01-04  2.625047 -0.232371  2.332271  1.067805
4  2000-01-05  3.835167  0.466320  1.088676  2.083621

### HDF5
Reading and writing to [HDFStores](https://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5 "HDF5 (PyTables)").

Writing to a HDF5 Store.

In [152]:
df.to_hdf('foo.h5', 'df')

Reading from a HDF5 Store.

In [153]:
pd.read_hdf('foo.h5','df').head()

                   A         B         C         D
2000-01-01 -0.128407  1.053644  0.762004 -0.838496
2000-01-02 -0.694843 -1.405031  2.776359  0.947008
2000-01-03  1.864596 -0.520070  3.235581  1.903378
2000-01-04  2.625047 -0.232371  2.332271  1.067805
2000-01-05  3.835167  0.466320  1.088676  2.083621

### Excel
Reading and writing to [MS Excel](https://pandas.pydata.org/pandas-docs/stable/io.html#io-excel "Excel files").

Writing to an excel file.

In [154]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

Reading from an excel file.

In [155]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA']).head()

                   A         B         C         D
2000-01-01 -0.128407  1.053644  0.762004 -0.838496
2000-01-02 -0.694843 -1.405031  2.776359  0.947008
2000-01-03  1.864596 -0.520070  3.235581  1.903378
2000-01-04  2.625047 -0.232371  2.332271  1.067805
2000-01-05  3.835167  0.466320  1.088676  2.083621

<br><br>

## Gotchas
---
If you are trying an operation and you see an exception like:

In [156]:
if pd.Series([False, True, False]):
    print("I was true")

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

See [Comparisons](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-compare "Flexible Comparisons") for an explanation and what to do.

See [Gotchas](https://pandas.pydata.org/pandas-docs/stable/gotchas.html#gotchas "Frequently Asked Questions (FAQ)") as well.